
#Область ПрограммныйИнтерфейс

// Меняет настройку условного оформления (а именно Текст) для РС НастройкаШаблоновБизнесПроцессов
//   Чтобы в ДГУ отличалось от КОРП.
//
// Параметры
// Форма - Управляемая форма
Процедура УсловноеОформление_НастройкаШаблоновБизнесПроцессов(Форма) Экспорт
	
	Если Форма.УсловноеОформление.Элементы.Количество() = 1 Тогда	
		Элем = Форма.УсловноеОформление.Элементы[0];
		
		ПарамТекст = Новый ПараметрКомпоновкиДанных("Текст");
		Для Каждого ЭлемОформления Из Элем.Оформление.Элементы Цикл
			
			Если ЭлемОформления.Параметр = ПарамТекст Тогда
				ЭлемОформления.Значение = РедакцииКонфигурацииКлиентСервер.ДляВсехОрганизаций();
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти