////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры и функции для работы с электронными подписями.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает полный путь к изображению отметки ЭП по описанию ЭП.
//
// Параметры:
//   ОписаниеЭП - Структура со свойствами:
//     Номер - Строка - серийный номер
//     Владелец - Строка - владелец сертификата (CN).
//     ДатаНачала - Дата - дата начала действия сертификата.
//     ДатаОкончания - Дата - дата окончания действия сертификата.
//
// Возвращаемое значение:
//   Строка - полный путь к файлу с изображением отметки ЭП.
//
//      пример кода
//
//	ПараметрыСоздания = Новый Массив;
//	
//	ПараметрыСоздания.Добавить(
//		"convert -size 1210x310 xc:white");
//	
//	ПараметрыСоздания.Добавить(
//		"-fill white -stroke black -draw ""rectangle 3,3 1207,307""");
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"-fill black -stroke black -pointsize 38 -size 700x100 -gravity North caption:""%1"" -geometry +0+5 -composite",
//			НСтр("ru = 'ДОКУМЕНТ ПОДПИСАН ЭЛЕКТРОННОЙ ПОДПИСЬЮ'")));
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"-fill black -stroke none -pointsize 36 -size 250x50 -gravity NorthWest caption:""%1"" -geometry +10+100 -composite",
//			НСтр("ru = 'Сертификат:'")));
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"caption:""%1"" -geometry +10+150 -composite",
//			НСтр("ru = 'Владелец:'")));
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"caption:""%1"" -geometry +10+250 -composite",
//			НСтр("ru = 'Действителен:'")));
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"-size 940x50 caption:""%1"" -geometry +260+100 -composite",
//			ОписаниеЭП.Номер));
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"caption:""%1"" -geometry +260+150 -composite",
//			Строка(ОписаниеЭП.Владелец)));
//	
//	ПараметрыСоздания.Добавить(
//		СтрШаблон(
//			"caption:""%1"" -geometry +260+250 -composite",
//			СтрШаблон(
//				НСтр("ru = 'с %1 по %2'"),
//				Формат(ОписаниеЭП.ДатаНачала, "ДФ=dd.MM.yyyy"),
//				Формат(ОписаниеЭП.ДатаОкончания, "ДФ=dd.MM.yyyy"))));
//	
//	ПутьНовогоФайла = ПолучитьИмяВременногоФайла("PNG");
//	
//	ПараметрыСоздания.Добавить(ПутьНовогоФайла);
//	
//	ПараметрыImageMagick = СтрСоединить(ПараметрыСоздания, " ");
//	
//	РаботаСКартинками.ЗапуститьImageMagick(ПараметрыImageMagick, Новый Массив);
//	
//	Возврат ПутьНовогоФайла;
//
Функция СоздатьОтметкуЭП(ОписаниеЭП) Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти
