
#Область ПрограммныйИнтерфейс

// Имя конфигурации
Функция ИмяКонфигурации() Экспорт
	
	Возврат "ДокументооборотКОРП";
	
КонецФункции	

// Идентификатор конфигурации
Функция ИдентификаторКонфигурации() Экспорт
	
	Возврат "DocMngCorp";
	
КонецФункции	

// Комментарий к обработчику обновления на 2.1.0.7
Функция Комментарий_2107() Экспорт
	
	Возврат НСтр("ru = 'Установка признака ""Вести учет по организациям"" для видов внутренних документов.'");
	
КонецФункции	

// Имя организации
Функция ИмяОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Наша организация'");
	
КонецФункции	

// Организация
Функция Организация() Экспорт
	
	Возврат НСтр("ru = 'Организация'");
	
КонецФункции	

// Организации
Функция Организации() Экспорт
	
	Возврат НСтр("ru = 'Организации'");
	
КонецФункции	

// Имя организации без учета сторон
Функция ИмяОрганизацииБезУчетаСторон() Экспорт
	
	Возврат НСтр("ru = 'Наша организация'");
	
КонецФункции	

// Подсказка организации без учета сторон
Функция ПодсказкаОрганизацииБезУчетаСторон() Экспорт
	
	Возврат НСтр("ru = 'Организация'");
	
КонецФункции	

// Имя организации с учетом сторон
Функция ИмяОрганизацииУчетСторон() Экспорт
	
	Возврат НСтр("ru = 'Наше предприятие'");
	
КонецФункции	

// Подсказка организации с учетом сторон
Функция ПодсказкаОрганизацииУчетСторон() Экспорт
	
	Возврат НСтр("ru = 'Предприятие'");
	
КонецФункции	

// Ошибка получения организации
Функция ОшибкаПолученияОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Ошибка при получении организации'");
	
КонецФункции	

// Ошибка создания организации
Функция ОшибкаСозданияОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Ошибка при создании организации'");
	
КонецФункции	

// Ошибка изменения организации
Функция ОшибкаИзмененияОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Ошибка при изменении организации'");
	
КонецФункции	

// Ошибка записи организации
Функция ОшибкаЗаписиОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Ошибка при записи организации'");
	
КонецФункции	

// Текст вопроса при очистке организации
Функция ВопросПоказатьДиалогОчисткаОрганизации() Экспорт
	
	Возврат НСтр(
		"ru = 'Отключен учет по организациям. У %1 этого вида указана
		|организация, и они попадут в отчеты и отборы по ней.
		|
		|Очистить организацию? Это действие необратимо!'");
	
КонецФункции	

// Имя процесса уведомления об ошибке изменения организации
Функция ВыполнитьИзменениеОрганизацииОшибкаИмяПроцесса() Экспорт
	
	Возврат НСтр("ru ='Не удалось изменить организацию в документах вида ""%1""'");
	
КонецФункции		

// Текст ошибки при изменении организации
Функция ВыполнитьИзменениеОрганизацииОшибка() Экспорт
	
	Возврат НСтр("ru = 'Не удалось изменить организацию в документах вида ""%1"".
			|
			|Произошла ошибка при попытке автоматически изменить организацию в документах
			|после изменения флага ""Вести учет по организациям"". Следует повторить попытку,
			|устранив причины, или воспользоваться обработкой ""Групповое изменение реквизитов"".
			|Ошибка:
			|%2'");
	
КонецФункции	

// Ошибка "Не выбрана организация"
Функция ОшибкаНеВыбранаОрганизация() Экспорт
	
	Возврат НСтр("ru = 'Не выбрана организация'");
	
КонецФункции	

// Ошибка "Не выбрана организация нумерации"
Функция ОшибкаНеВыбранаОрганизацияНумерации() Экспорт
	
	Возврат НСтр("ru = 'Укажите организацию, к которой отнести существующие номера'");
	
КонецФункции	

// Индекс организации
Функция ИндексОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Индекс организации'");
	
КонецФункции	

// Юридический адрес организации
Функция ЮрАдресОрганизации() Экспорт
	
	Возврат НСтр("ru='Юридический адрес организации'");
	
КонецФункции	

// Фактический адрес организации
Функция ФактАдресОрганизации() Экспорт
	
	Возврат НСтр("ru='Фактический адрес организации'");
	
КонецФункции	

// Телефон организации
Функция ТелефонОрганизации() Экспорт
	
	Возврат НСтр("ru='Телефон организации'");
	
КонецФункции	

// Факс организации
Функция ФаксОрганизации() Экспорт
	
	Возврат НСтр("ru='Факс организации'");
	
КонецФункции	

// Адрес электронной почты организации
Функция EmailОрганизации() Экспорт
	
	Возврат НСтр("ru='Адрес электронной почты организации'");
	
КонецФункции	

// Почтовый адрес организации
Функция ПочтовыйАдресОрганизации() Экспорт
	
	Возврат НСтр("ru='Почтовый адрес организации'");
	
КонецФункции	

// Ошибка при выборе основного банковского счета
Функция ОсновнойБанковскийСчетОшибка() Экспорт
	
	Возврат НСтр("ru = 'Для выбора основного счета необходимо записать организацию'");
	
КонецФункции	

// Ошибка в префиксе организации
Функция ОшибкаПрефиксОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Нельзя в префиксе организации использовать символ ""-"".'");
	
КонецФункции	

// Ошибка в номенклатуре организации
Функция ОшибкаНоменклатураОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Организация элемента номенклатуры дел не совпадает с организацией раздела'");
	
КонецФункции	

// Ошибка проверки заполнения номенклатуры организации
Функция ОшибкаПроверкиЗаполненияНоменклатураОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Организация номенклатуры дел ""%1"" не совпадает с организацией раздела'");
	
КонецФункции	

// Ошибка раздела номенклатуры дел
Функция ОшибкаРазделыНоменклатурыДел() Экспорт
	
	Возврат НСтр("ru = 'Организация раздела не совпадает с организацией вышестоящего раздела'");
	
КонецФункции	

//
Функция ОшибкаПередачаДелВАрхив() Экспорт
	
	Возврат НСтр("ru = 'Дело ""%1"" не относится к организации ""%2"".'");
	
КонецФункции	

// Не заполнено поле Организация
Функция ОшибкаНеЗаполненоПолеОрганизация() Экспорт
	
	Возврат НСтр("ru = 'Не заполнено поле ""Организация""'");
	
КонецФункции	

// Для всех организаций
Функция ДляВсехОрганизаций() Экспорт
	
	Возврат НСтр("ru = 'Для всех организаций'");
	
КонецФункции	

// Поле НазначениеОрганизации - подсказка ввода
Функция НазначениеОрганизацииПодсказкаВвода() Экспорт 
	
	Возврат НСтр("ru = 'Включен учет по организациям. У некоторых документов
	|этого вида организация не указана (%1 шт).
    |
	|Назначить им выбранную организацию?'");

	
КонецФункции	

// из организации
Функция ИзОрганизации() Экспорт
	
	Возврат НСтр("ru = 'из организации'");
	
КонецФункции	

// в организацию
Функция ВОрганизацию() Экспорт
	
	Возврат НСтр("ru = 'в организацию'");
	
КонецФункции	

// для организации
Функция ДляОрганизации() Экспорт
	
	Возврат НСтр("ru = 'для организации'");
	
КонецФункции	

// Заполнение разделов
Функция ЗаполнениеРазделов() Экспорт
	
	Возврат НСтр("ru = 'Заполнение разделов по структуре предприятия'");
	
КонецФункции	

// Вид организации
Функция ВидОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Вид организации:'");
	
КонецФункции	

// Декорация НадписьОрганизации
Функция ДекорацияНадписьОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Если не указана ни одна организация, то используется для всех.'");
	
КонецФункции	

// Данные предприятия
Функция ДанныеПредприятия() Экспорт
	
	Возврат НСтр("ru = 'Данные предприятия'");
	
КонецФункции	

// Учет по организациям
Функция УчетПоОрганизациям() Экспорт
	
	Возврат НСтр("ru = 'Учет по организациям'");
	
КонецФункции	

// Установка сведений о предприятии
Функция УстановкаСведенийОПредприятии() Экспорт
	
	Возврат НСтр("ru = 'Установка сведений о предприятии.'");
	
КонецФункции	

// Действует для организации
Функция ДействуетДляОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Действует для организации'");
	
КонецФункции	

// Все организации
Функция ВсеОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Все организации'");
	
КонецФункции	

// В организацию
Функция ВОрганизациюВРег() Экспорт
	
	Возврат НСтр("ru = 'В организацию'");
	
КонецФункции	

#КонецОбласти