
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		НастроитьЭлементыФормыДляМобильногоУстройства();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ВариантОтвета = Истина;
	
	Если БольшеНеСпрашивать Тогда
		ЗапомнитьВариантОтвета(ВариантОтвета);
	КонецЕсли;
	
	Закрыть(ВариантОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСоздавать(Команда)
	
	ВариантОтвета = Ложь;
	
	Если БольшеНеСпрашивать Тогда
		ЗапомнитьВариантОтвета(ВариантОтвета);
	КонецЕсли;
	
	Закрыть(ВариантОтвета);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗапомнитьВариантОтвета(ВариантОтвета)
	
	Отсутствия.УстановитьПерсональнуюНастройку("ВопросСоздатьПисьмоБольшеНеСпрашивать", Истина);
	Отсутствия.УстановитьПерсональнуюНастройку("ВопросСоздатьПисьмоВариантОтвета", ВариантОтвета);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыДляМобильногоУстройства()
	
	Элементы.ГруппаПодвал.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
КонецПроцедуры

#КонецОбласти