#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПервоеСообщениеЧатБотаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru = 'Введите сообщение бота'");
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПервоеСообщениеЧатБотаНачалоВыбораПослеВводаТекста", 
		ЭтотОбъект);
	ПоказатьВводСтроки(ОписаниеОповещения, НаборКонстант.ПервоеСообщениеЧатБота, Заголовок,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервоеСообщениеЧатБотаНачалоВыбораПослеВводаТекста(Текст, Параметры) Экспорт

	Если Текст = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НаборКонстант.ПервоеСообщениеЧатБота = Текст;

КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСписокСостоянийЧатБота(Команда)
	
	ОткрытьФорму("Справочник.СостоянияЧатБота.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти
