
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Абонент = ПрограммныйИнтерфейсСервиса.АбонентЭтогоПриложения();
	Сведения = ПрограммныйИнтерфейсСервиса.ДополнительныеСведенияАбонента();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Абонент, "Наименование, Код");
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (%2)", Абонент.Наименование, НСтр("ru = 'Абонент'"));
	
	Для Каждого КлючЗначение Из Сведения.Свойства Цикл
		НоваяСтрока = ДополнительныеСвойства.Добавить();
		НоваяСтрока.Свойство = КлючЗначение.Ключ;
		НоваяСтрока.Значение = КлючЗначение.Значение;
	КонецЦикла; 
	
	Для Каждого КлючЗначение Из Сведения.Реквизиты Цикл
		НоваяСтрока = ДополнительныеРеквизиты.Добавить();
		НоваяСтрока.Реквизит = КлючЗначение.Ключ;
		НоваяСтрока.Значение = КлючЗначение.Значение;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 