#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет, поддерживает ли способ уведомления локальные уведомления.
//
// Параметры:
//  СпособУведомления - ПеречислениеСсылка.СпособыУведомления - Способ уведомления.
// 
// Возвращаемое значение:
//  Булево - Способ уведомления поддерживает локальные уведомления.
//
Функция ПоддерживаетЛокальныеУведомления(СпособУведомления) Экспорт
	
	Возврат СпособУведомления <> Окном;
	
КонецФункции

#КонецОбласти

#КонецЕсли