////////////////////////////////////////////////////////////////////////////////
// Помощник отправить (клиент/сервер): Содержит интерфейсные функции для работы
//                                     с помощником отправки.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет, что переданный вариант является вариантом СоздатьПисьмоНаОснованииа.
//
// Параметры:
//  Вариант - Произвольный - вариант помощника.
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВариантСоздатьПисьмоНаОсновании(Вариант) Экспорт
	
	Если Вариант = ВариантОтправкиСоздатьПисьмоНаОсновании() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет, что переданный вариант является вариантом создания процесса.
//
// Параметры:
//  Вариант - Произвольный - вариант помощника.
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВариантСозданияПроцесса(Вариант) Экспорт
	
	Возврат ШаблоныБизнесПроцессовКлиентСервер.ЭтоШаблонПроцесса(Вариант)
		Или Вариант = ГруппаДругихВариантовСозданияПроцессов();
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс_РежимыРаботы

// Возвращает режим работы ОтправкаОбъектов.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимРаботыОтправкаОбъектов() Экспорт
	
	Возврат "ОтправкаОбъектов";
	
КонецФункции

// Возвращает режим работы ОтправкаПроцесса.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимРаботыОтправкаПроцесса() Экспорт
	
	Возврат "ОтправкаПроцесса";
	
КонецФункции

// Возвращает режим работы ОтправкаПодзадачи.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимРаботыОтправкаПодзадачи() Экспорт
	
	Возврат "ОтправкаПодзадачи";
	
КонецФункции

// Возвращает режим работы ОтправкаПользователям.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимРаботыОтправкаПользователям() Экспорт
	
	Возврат "ОтправкаПользователям";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет и возвращает наличие объектов указанных типов в параметрах.
//
// Параметры:
//  Объекты - Массив - ссылки на объекты.
//  ТипыОбъектов - Соответствие
//   * Ключ - Тип
//   * Значение - Булево - всегда Истина.
//
// Возвращаемое значение:
//  Булево - Истина, если объект есть.
//
Функция ЕстьОбъектыУказанныхТипов(Объекты, ТипыОбъектов) Экспорт
	
	ЕстьОбъекты = Ложь;
	Для Каждого Объект Из Объекты Цикл
		Если ТипыОбъектов[ТипЗнч(Объект)] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЕстьОбъекты = Истина;
		Прервать;
	КонецЦикла;
	
	Возврат ЕстьОбъекты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ПредопределенныеВарианты

// Возвращает вид варианта отправки СоздатьПисьмоНаОсновании.
//
// Возвращаемое значение:
//  Строка
//
Функция ВариантОтправкиСоздатьПисьмоНаОсновании() Экспорт
	
	Возврат "СоздатьПисьмоНаОсновании";
	
КонецФункции

// Возвращает вид варианта отправки Еще.
//
// Возвращаемое значение:
//  Строка
//
Функция ГруппаДругихВариантовСозданияПроцессов() Экспорт
	
	Возврат "ДругиеВариантыСозданияПроцессов";
	
КонецФункции

#КонецОбласти