#Область ПрограммныйИнтерфейс

// Возвращает массив имен ключевых реквизитов
Функция ПолучитьИменаКлючевыхРеквизитов(Версия = Неопределено) Экспорт
	
	МассивИмен = Новый Массив;
	
	// Подписание и доступность полей в карточке документа
	Если Версия = Неопределено Тогда
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("АвторРезолюции");
		МассивИмен.Добавить("ВнесРезолюцию");
		МассивИмен.Добавить("ДатаРезолюции");
		МассивИмен.Добавить("ТекстРезолюции");
		
	// Проверка подписей
	Иначе
		
		Если Версия = 1 Тогда
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("АвторРезолюции");
			МассивИмен.Добавить("ВнесРезолюцию");
			МассивИмен.Добавить("ДатаРезолюции");
			МассивИмен.Добавить("ТекстРезолюции");
			МассивИмен.Добавить("Наименование");
		Иначе
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("АвторРезолюции");
			МассивИмен.Добавить("ВнесРезолюцию");
			МассивИмен.Добавить("ДатаРезолюции");
			МассивИмен.Добавить("ТекстРезолюции");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции

#КонецОбласти