
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СсылкаНаКатегорию") Тогда
		Если НЕ Параметры.СсылкаНаКатегорию.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
			"Категория",
			Параметры.СсылкаНаКатегорию,
			ВидСравненияКомпоновкиДанных.Равно);
			Категория = Параметры.СсылкаНаКатегорию;
			Элементы.Список.ПодчиненныеЭлементы.Категория.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		ПараметрыФормы = Новый Структура("Категория", Категория);
		ОткрытьФорму("Справочник.ПравилаАвтоматическойКатегоризацииДанных.ФормаОбъекта", ПараметрыФормы, Элемент); 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры                                       

&НаКлиенте
Процедура ПроверитьПравило(Команда)
	
	Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура("ПравилоАК", Элементы.Список.ТекущиеДанные.Ссылка);
	 	ОткрытьФорму("Справочник.ПравилаАвтоматическойКатегоризацииДанных.Форма.ФормаПроверкаПравила", ПараметрыФормы,,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры
	
