
Процедура СоздатьОбластиДелегированияЕслиНужно() Экспорт
	
	ОписаниеОбластейДелегирования = НастраиваемоеДелегированиеПрав.ОписанияНачальногоЗаполненияОбластейДелегирования();
	Для Каждого Строка Из ОписаниеОбластейДелегирования Цикл
		
		ОбластьДелегированияСсылка = Справочники.ОбластиДелегированияПрав.ПолучитьСсылку(
			Новый УникальныйИдентификатор(Строка.Идентификатор));
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ИСТИНА
			|ИЗ
			|	Справочник.ОбластиДелегированияПрав КАК ОбластиДелегированияПрав
			|ГДЕ
			|	ОбластиДелегированияПрав.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ОбластьДелегированияСсылка);
		
		Если Запрос.Выполнить().Пустой() Тогда // Элемента данных нет, нужно создать новый
			ОбластьОбъект = Справочники.ОбластиДелегированияПрав.СоздатьЭлемент();
			ОбластьОбъект.УстановитьСсылкуНового(ОбластьДелегированияСсылка);
			ОбластьОбъект.Наименование = Строка.Наименование;
			ОбластьОбъект.ИмяПредопределенныхДанных = Строка.ИмяПредопределенного;
			Для Каждого ПолноеИмя Из Строка.Состав Цикл
				НоваяСтрока = ОбластьОбъект.Состав.Добавить();
				НоваяСтрока.ОбъектМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмя);
			КонецЦикла;
			ОбластьОбъект.ДополнительныеСвойства.Вставить("НеПересчитыватьПрава", Истина);
			ОбластьОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
