
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Политика = Константы.ПолитикаУчетаРабочегоВремени.Получить();
	Если Значение Тогда
		Если Политика <> Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеОтчеты
			И Политика <> Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
			ВызватьИсключение 
				НСтр("ru = 'Политика учета рабочего времени не предусматривает ведение ежедневных отчетов.'");
		КонецЕсли;
	Иначе
		Если Политика = Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеОтчеты
			Или Политика = Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
			ВызватьИсключение 
				НСтр("ru = 'Политика учета рабочего времени предусматривает ведение ежедневных отчетов.'");
		КонецЕсли;
	КонецЕсли;
	
	Если Значение Тогда
		Константы.ИспользоватьДокументыУчетаРабочегоВремени.Установить(Истина);
	ИначеЕсли Не Константы.ИспользоватьЕженедельныеОтчеты.Получить() Тогда
		Константы.ИспользоватьДокументыУчетаРабочегоВремени.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры
