&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	               
	КлючевыеОперации = "ЗадачаИсполнителяОткрытиеФормыМоиЗадачи";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючевыеОперации);
	
#Если МобильныйКлиент Тогда
	ИмяФормы = "Задача.ЗадачаИсполнителя.Форма.МК_ЗадачиМне";
#Иначе
	ИмяФормы = БизнесПроцессыИЗадачиВызовСервера.ИмяФормыЗадачиМне();
#КонецЕсли
	
	ОткрытьФорму(
		ИмяФормы,
		,
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
