
&НаСервере
Процедура ПодготовитьОбластьНаСервере(Разделитель)
	
	РаботаВМоделиСервисаПереопределяемый.ВойтиВОбластьДанных(Разделитель, Метаданные.РегистрыСведений.ОбластиДанных);
	
	Попытка
		
		РаботаВМоделиСервиса.ПодготовитьОбластьДанныхКИспользованию(Разделитель,, "Основной");
		
	Исключение
		
		РаботаВМоделиСервисаПереопределяемый.ВойтиВОбластьДанных(Неопределено, Метаданные.РегистрыСведений.ОбластиДанных);
		ВызватьИсключение;
		
	КонецПопытки;
	
	РаботаВМоделиСервисаПереопределяемый.ВойтиВОбластьДанных(Неопределено, Метаданные.РегистрыСведений.ОбластиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьОбласть(Команда)
	
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		ПодготовитьОбластьНаСервере(Элементы.Список.ДанныеСтроки(Строка).ОбластьДанныхВспомогательныеДанные);
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
