
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Заголовок", НСтр("ru = 'Ответы на вопросы по 1С:Документообороту 8'"));
	Параметры.Вставить("АдресСтраницы", "https://its.1c.ru/db/answers1c#content:1152:hdoc");
	Параметры.Вставить("ОтображатьКоманднуюПанель", Ложь);
	ОткрытьФорму("Обработка.Обозреватель.Форма.Форма", Параметры, ПараметрыВыполненияКоманды.Источник, "ОтветыНаВопросы", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры