////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с обсуждениями.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает ключ обсуждения.
//
// Параметры:
//  ИдентификаторОбсужденияСтрокой - идентификатор обсуждения, преобразованный в строку.
//
// Возвращаемое значение:
//  Строка - ключ обсуждения.
//
Функция КлючОбсуждения(ИдентификаторОбсужденияСтрокой) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторОбсужденияСтрокой) Тогда
		Возврат "";
	КонецЕсли;
	
	ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(
		ИдентификаторОбсужденияСтрокой);
	
	Возврат ОбсужденияДокументооборотВызовСервера.КлючОбсуждения(ИдентификаторОбсуждения);
	
КонецФункции

// Возвращает данные, необходимые для автоподбора пользователей СВ.
//
// Параметры:
//  ИдентификаторОбсужденияСтрокой - идентификатор обсуждения, преобразованный в строку.
//  КонтекстСсылка - Ссылка, Неопределено - контекст обсуждения.
//
// Возвращаемое значение:
//  Строка - ключ обсуждения.
//
Функция ДанныеОбсужденияДляАвтоподбора(ИдентификаторОбсужденияСтрокой, КонтекстСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторОбсужденияСтрокой)
		И Не ЗначениеЗаполнено(КонтекстСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторОбсуждения = Неопределено;
	Если ЗначениеЗаполнено(ИдентификаторОбсужденияСтрокой) Тогда
		ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(
			ИдентификаторОбсужденияСтрокой);
	КонецЕсли;
	
	Возврат ОбсужденияДокументооборотВызовСервера.ДанныеОбсужденияДляАвтоподбора(
		ИдентификаторОбсуждения, КонтекстСсылка);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
