#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборПоказыватьНедействительные();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьОтборПоказыватьНедействительные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьНедействительные(Команда)
	
	ПоказыватьНедействительные = Не ПоказыватьНедействительные;
	УстановитьОтборПоказыватьНедействительные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоказыватьНедействительные()
	
	Параметр = Список.Параметры.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ОтборПоказыватьНедействительные"));
	Параметр.Использование = Ложь;
	
	Элементы.ФормаПоказыватьНедействительные.Пометка = ПоказыватьНедействительные;
	
	Если Не ПоказыватьНедействительные Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоказыватьНедействительные", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти