
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьСостояниеОжидания", 3, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыйтиИзРежимаСканирования(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСостояниеОжидания()
	
	Владелец = ВладелецФормы;
	Если МП_МобильныйСканерВызовСервера.СканЗагружен() Тогда
		СканДобавлен = МП_МобильныйСканерКлиент.ОбработатьСкан(Владелец.Объект.Ссылка);
		Если СканДобавлен Тогда
			КоличествоДобавленныхСканов = КоличествоДобавленныхСканов + 1;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти