
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийЭлемент = Элементы.СоздаватьАвточатыДляПодразделений;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЛимитРазмераАвточатовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьАвточатыДляПодразделенийПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьОбсужденияДляСуществующихЭлементов(Команда)
	
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.СозданиеАвтообновляемыхОбсуждений");
	
КонецПроцедуры

#КонецОбласти
