
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПредставлениеФайла();
	
	ЗаполнитьДатыДляОтображения();
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, Запись.Файл);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредставлениеФайла()
	
	СсылкаНаФайл1 = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
		Запись.Файл, "Владелец");
	
	СсылкаНаФайл2 = Запись.Файл;
	
	ПредставлениеФайла = "";
	Если ЗначениеЗаполнено(СсылкаНаФайл1) Тогда
		ПредставлениеФайла = Строка(СсылкаНаФайл1) + ", ";
	КонецЕсли;
	Если ЗначениеЗаполнено(СсылкаНаФайл2) Тогда
		ПредставлениеФайла = ПредставлениеФайла + Строка(СсылкаНаФайл2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыДляОтображения()
	
	ДатаСеанса = ТекущаяДатаСеанса();
	ДатаСеансаУниверсальная = УниверсальноеВремя(ДатаСеанса, ЧасовойПоясСеанса());
	ПоправкаКУниверсальномуВремени = ДатаСеансаУниверсальная - ДатаСеанса;
	
	ДатаПередачиНаРаспознавание = Запись.ДатаПередачиНаРаспознавание - ПоправкаКУниверсальномуВремени;
	ДатаПоследнейПроверкиРезультата = Запись.ДатаПоследнейПроверкиРезультата - ПоправкаКУниверсальномуВремени;
	
КонецПроцедуры

#КонецОбласти
