////////////////////////////////////////////////////////////////////////////////
// Подсистема "Напоминания пользователя" (вызов сервера) - переопределение в конфигурации Документооборот.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Прекращает напоминания.
//
// Параметры:
//  ПрекращаемыеНапоминания - Массив - Напоминания, которые необходимо прекратить.
//                                     См. НапоминанияПользователяКлиентСервер.ОписаниеНапоминания().
// 
// Возвращаемое значение:
//  Массив - Результаты прекращения напоминаний.
//   * ПодключеноНовоеНапоминание - Булево                  - Было подключено новое напоминание, вместо прекращенного.
//   * НовоеНапоминание           - Структура, Неопределено - Новое напоминание, если оно было подключено.
//                                                            См. НапоминанияПользователяКлиентСервер.ОписаниеНапоминания().
//   * ИсточникНапоминания        - ЛюбаяСсылка             - Источник напоминания.
//
Функция ПрекратитьНапоминания(Знач ПрекращаемыеНапоминания) Экспорт
	
	РезультатыПрекращенияНапоминаний =
		НапоминанияПользователяДокументооборот.ПрекратитьНапоминания(ПрекращаемыеНапоминания);
	
	Возврат РезультатыПрекращенияНапоминаний;
	
КонецФункции

#КонецОбласти