
#Область ПрограмныйИнтерфейс

// Добавляет запись в регистр
// 
// Параметры:
//  ЗаписьБеседы - Структура - См. РаботаСЧатБотомКлиентСервер.НоваяЗаписьБеседы()
//
Процедура ОбновитьИсториюБеседы(ЗаписьБеседы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьБеседы.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	МенеджерЗаписи = РегистрыСведений.ИсторияБеседСЧатБотом.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗаписьБеседы);
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
