////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с чат-ботом (глобальный).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограмныйИнтерфейс

// Выполняет процедуру "РаботаСЧатБотомКлиент.ВыполнитьДействие"
Процедура ВыполнитьДействиеОтложенно() Экспорт

	РаботаСЧатБотомКлиент.ВыполнитьДействие();
	
КонецПроцедуры

// Выполняет процедуру "РаботаСЧатБотомКлиент.ОбработатьСостояние"
Процедура ОбработатьСостояниеОтложенно() Экспорт
	
	РаботаСЧатБотомКлиент.ОбработатьСостояние();
	
КонецПроцедуры

#КонецОбласти 
