
Функция ШаблонURLМетод(Запрос)	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Причина = "Просто так, без причин!";
	Возврат Ответ;
КонецФункции

Функция СтруктураСБольшимКоличествомКлючей() Экспорт
	Структура = Новый Структура();
	Структура.Вставить("П1","");
	Структура.Вставить("П2","Значение");
	Структура.Вставить("П3",Неопределено);
	Структура.Вставить("П4",);
	Структура.Вставить("П5",1);
	Структура.Вставить("П6",2);
	Структура.Вставить("П7",Ложь);
	Структура.Вставить("П8");

	Возврат Структура;
КонецФункции


Функция СтруктураСБольшимКоличествомКлючей2() Экспорт
	Структура = Новый Структура("П1,П2,П3,П4,П5,П6,П7,П8", 
								"",
								"Значение",
								Неопределено,
								,
								1,
								2,
								Ложь);
	Возврат Структура;
КонецФункции


Функция СтруктураСБольшимКоличествомКлючей3() Экспорт
	Структура = Новый Структура("П1,П2,П3,П4,П5,П6,П7,П8", 
								"",
								"Значение",
								Неопределено,
								,
								1,
								2,
								Ложь);
	Возврат Структура;
КонецФункции 
  
 
