////////////////////////////////////////////////////////////////////////////////
// Работа с часовымп поясами (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Актуализирует часовой пояс текущего пользователя.
//
// Параметры:
//  АктуальныйЧасовойПояс - Строка - Актуальный часовой пояс пользователя в формате GMT{+/-}hh:mm.
//
Процедура АктуализироватьЧасовойПояс(Знач АктуальныйЧасовойПояс) Экспорт
	
	РаботаСЧасовымиПоясами.АктуализироватьЧасовойПояс(
		АктуальныйЧасовойПояс,
		Пользователи.ТекущийПользователь());
	
КонецПроцедуры

// Преобразует местное время к дате в часовом поясе сеанса.
//
// Параметры:
//  Дата - Дата - Местное время.
// 
// Возвращаемое значение:
//  Дата - Дата в часовом поясе сеанс.
//
Функция ПривестиКВремениСеанса(Знач МестнаяДата) Экспорт
	
	Возврат РаботаСЧасовымиПоясами.ПривестиКВремениСеанса(МестнаяДата);
	
КонецФункции

// Возвращает параметры преобразования местного времени.
// 
// Возвращаемое значение:
//  Структура - Параметры преобразования местного времени.
//   * РежимОтображенияМестногоВремени - ПеречислениеСсылка.РежимыОтображенияМестногоВремени - Действующий режим отображения местного времени.
//   * МестныйЧасовойПояс              - Строка                                              - Местный часовой пояс в формате GMT{+/-}hh:mm.
//   * ЧасовойПоясПоУмолчанию          - Строка                                              - Часовой пояс по умолчанию в формате GMT{+/-}hh:mm.
//
Функция ПараметрыПреобразованияМестногоВремени() Экспорт
	
	Возврат РаботаСЧасовымиПоясами.ПараметрыПреобразованияМестногоВремени();
	
КонецФункции

#КонецОбласти