
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидЭД = Параметры.ВидЭД;
	ТипЭД = Параметры.ТипЭД;
	ТребуетсяИзвещениеОПолучении = Параметры.ТребуетсяИзвещениеОПолучении;
	ТребуетсяОтветнаяПодпись = Параметры.ТребуетсяОтветнаяПодпись;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидЭДПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Закрыть(СтруктураНастроек());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	ПустойВидЭД = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПустаяСсылка");
	ПроизвольныйВидЭД = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПроизвольныйЭД");
	
	Если ВидЭД = ПустойВидЭД ИЛИ ВидЭД = ПроизвольныйВидЭД Тогда
		
		Элементы.ТипЭД.Видимость = Истина;
		Элементы.ТребуетсяИзвещениеОПолучении.Видимость = Истина;
		Элементы.ТребуетсяОтветнаяПодпись.Видимость = Истина;
		
	Иначе
		
		Элементы.ТипЭД.Видимость = Ложь;
		Элементы.ТребуетсяИзвещениеОПолучении.Видимость = Ложь;
		Элементы.ТребуетсяОтветнаяПодпись.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураНастроек()
	
	СтруктураНастроек = Новый Структура;
	
	ПустойВидЭД = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПустаяСсылка");
	ПроизвольныйВидЭД = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПроизвольныйЭД");
	
	Если ВидЭД = ПустойВидЭД ИЛИ ВидЭД = ПроизвольныйВидЭД Тогда
		
		СтруктураНастроек.Вставить("ВидЭД", ВидЭД);
		СтруктураНастроек.Вставить("ТипЭД", ТипЭД);
		СтруктураНастроек.Вставить("ТребуетсяИзвещениеОПолучении", ТребуетсяИзвещениеОПолучении);
		СтруктураНастроек.Вставить("ТребуетсяОтветнаяПодпись", ТребуетсяОтветнаяПодпись);
		
	Иначе
		
		СтруктураНастроек.Вставить("ВидЭД", ВидЭД);
		СтруктураНастроек.Вставить("ТипЭД", ПредопределенноеЗначение("Перечисление.ТипыЭД.Прочее"));
		СтруктураНастроек.Вставить("ТребуетсяИзвещениеОПолучении", Истина);
		СтруктураНастроек.Вставить("ТребуетсяОтветнаяПодпись", Истина);
		
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции


#КонецОбласти