////////////////////////////////////////////////////////////////////////////////
// Работа с часовыми поясами (клиент).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Актуализирует часовой пояс текущего пользователя, если необходимо.
//
// Параметры:
//  ТекущийЧасовойПояс - Строка - Текущий часовой пояс пользователя в формате GMT{+/-}hh:mm.
//
Процедура АктуализироватьЧасовойПояс(ТекущийЧасовойПояс) Экспорт
	
	СмещениеСтандартногоВремени = ТекущаяДата() - ОбщегоНазначенияКлиент.ДатаУниверсальная();
	АктуальныйЧасовойПояс = РаботаСЧасовымиПоясамиКлиентСервер.ЧасовойПоясСмещением(СмещениеСтандартногоВремени);
	Если ТекущийЧасовойПояс = АктуальныйЧасовойПояс
		Или АктуальныйЧасовойПояс = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	РаботаСЧасовымиПоясамиВызовСервера.АктуализироватьЧасовойПояс(АктуальныйЧасовойПояс);
	
КонецПроцедуры

// Преобразует дату в часовом поясе сеанса к местному времени.
//
// Параметры:
//  Дата                    - Дата      - Дата в часовом поясе сеанса.
//  ПараметрыПреобразования - Структура - Параметры преобразования местно времени. См. РаботаСЧасовымиПоясами.ПараметрыПреобразованияМестногоВремени().
// 
// Возвращаемое значение:
//  Дата - Местное время.
//
Функция ПривестиКМестномуВремени(ДатаСеанса) Экспорт
	
	Возврат РаботаСЧасовымиПоясамиКлиентСервер.ПривестиКМестномуВремени(
		ДатаСеанса,
		РаботаСЧасовымиПоясамиКлиентПовтИсп.ПараметрыПреобразованияМестногоВремени());
	
КонецФункции

// Преобразует местное время к дате в часовом поясе сеанса.
//
// Параметры:
//  Дата                    - Дата      - Местное время.
//  ПараметрыПреобразования - Структура - Параметры преобразования местно времени. См. РаботаСЧасовымиПоясами.ПараметрыПреобразованияМестногоВремени().
// 
// Возвращаемое значение:
//  Дата - Дата в часовом поясе сеанс.
//
Функция ПривестиКВремениСеанса(МестнаяДата) Экспорт
	
	Возврат РаботаСЧасовымиПоясамиКлиентСервер.ПривестиКВремениСеанса(
		МестнаяДата,
		РаботаСЧасовымиПоясамиКлиентПовтИсп.ПараметрыПреобразованияМестногоВремени());
	
КонецФункции

#КонецОбласти