////////////////////////////////////////////////////////////////////////////////
// Работа с часовыми поясами (клиент, повторное использование на время сеанса).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает параметры преобразования местного времени.
// 
// Возвращаемое значение:
//  Структура - Параметры преобразования местного времени.
//   * РежимОтображенияМестногоВремени - ПеречислениеСсылка.РежимыОтображенияМестногоВремени - Действующий режим отображения местного времени.
//   * МестныйЧасовойПояс              - Строка                                              - Местный часовой пояс в формате GMT{+/-}hh:mm.
//   * ЧасовойПоясПоУмолчанию          - Строка                                              - Часовой пояс по умолчанию в формате GMT{+/-}hh:mm.
//
Функция ПараметрыПреобразованияМестногоВремени() Экспорт
	
	Возврат РаботаСЧасовымиПоясамиВызовСервера.ПараметрыПреобразованияМестногоВремени();
	
КонецФункции

#КонецОбласти