
#Область ПрограммныйИнтерфейс

// Выполняет получение мультимедиа данных от устройства.
//
// Параметры:
//  ТипДанных - Строка- Идентификатор данных: "Фото", "Видео", "Аудио", "Файл".
//  ОписаниеОповещения - ОписаниеОповещения - Опо
// 
// Возвращаемое значение:
//  ДанныеМультимедиа или Строка - Полученные данные мультимедиа.
//
Процедура НачатьПолучениеМультимедиаДанных(ТипДанных, ОписаниеОповещения) Экспорт
	
	МультимедиаДанные = Неопределено;
#Если МобильныйКлиент Тогда
	Если ТипДанных = "Фото" 
		И СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
		
		КачествоФото = 75;
		МультимедиаДанные = СредстваМультимедиа.СделатьФотоснимок(, , КачествоФото);
		
	ИначеЕсли ТипДанных = "Видео" 
		И СредстваМультимедиа.ПоддерживаетсяВидеозапись() Тогда
		
		МультимедиаДанные = СредстваМультимедиа.СделатьВидеозапись();
		
	ИначеЕсли ТипДанных = "Аудио" 
		И СредстваМультимедиа.ПоддерживаетсяАудиозапись() Тогда
		
		МультимедиаДанные = СредстваМультимедиа.СделатьАудиозапись();

	ИначеЕсли ТипДанных = "Файл" Тогда
		
		ВыбратьФайлИзФайловогоХранилища(ОписаниеОповещения);
		
	КонецЕсли;
#Иначе
	ВыбратьФайлИзФайловогоХранилища(ОписаниеОповещения);
#КонецЕсли
	
	Если МультимедиаДанные <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, МультимедиаДанные);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру описание файла мультимедиа.
//
// Параметры:
//  Мультимедиа - ДанныеМультимедиа, Строка - Сведения о файле.
// 
// Возвращаемое значение:
//  Структура - Описание параметров файла мультимедиа.
//   * Ссылка               - УникальныйИдентификатор - Идентификатор нового файла;
//   * АдресВременногоФайла - Строка - Путь к файлу на диске;
//   * Расширение           - Строка - Тип файла (расширение);
//   * Размер               - Строка - Представление размера файла;
//   * Представление        - Строка - Представление файла (имя).
//   * Ошибка               - Строка - Текстовое описание ошибки.
//
Функция ИнформацияОМультимедиаФайле(Мультимедиа) Экспорт
	
	Если Мультимедиа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
#Если ВебКлиент Тогда
	Возврат Неопределено;
#Иначе
	ПредставлениеФайла = Неопределено;
	Расширение = Неопределено;
	ИмяВременногоФайла = Неопределено;
	ФайлДляКопирования = Неопределено;
	РазмерДанных = Неопределено;
	
	Если ТипЗнч(Мультимедиа) = Тип("Строка") Тогда
		
		//Мультимедиа - это адрес текущего файла
		Файл = Новый Файл(Мультимедиа);
		Если Не Файл.Существует() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		РазмерДанных = Файл.Размер();
		Расширение = Файл.Расширение;
		ПредставлениеФайла = Файл.Имя;
		
		// Если расширение пустое, тогда надо получить его другим путем.
		Если СтрНачинаетсяС(Файл.ПолноеИмя, "content") И ПустаяСтрока(Расширение) Тогда
			ПредставлениеФайла = Файл.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
			
			ПоложениеТочки = СтрНайти(ПредставлениеФайла, ".", НаправлениеПоиска.СКонца);
			Если ПоложениеТочки > 0 Тогда
				Расширение = Сред(ПредставлениеФайла, ПоложениеТочки + 1);
			КонецЕсли;
		КонецЕсли;
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		ФайлДляКопирования = Мультимедиа;
		
	Иначе
		Расширение = Мультимедиа.РасширениеФайла;
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		ФайлДляКопирования = Мультимедиа.ПолучитьДвоичныеДанные();
		РазмерДанных = ФайлДляКопирования.Размер();
		
	КонецЕсли;
	
	Ошибка = Неопределено;
	
	Если Ошибка = Неопределено Тогда
		Если ТипЗнч(ФайлДляКопирования) = Тип("Строка") Тогда
			КопироватьФайл(ФайлДляКопирования, ИмяВременногоФайла);
		Иначе
			ФайлДляКопирования.Записать(ИмяВременногоФайла);
			Файл = Новый Файл(ИмяВременногоФайла);
		КонецЕсли;
	КонецЕсли;
	ФайлДляКопирования = Неопределено;
	
	Если Не ЗначениеЗаполнено(ПредставлениеФайла) Тогда
		ПредставлениеФайла = Файл.Имя;
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("Представление", ПредставлениеФайла);
	ВозвращаемоеЗначение.Вставить("Расширение", Расширение);
	ВозвращаемоеЗначение.Вставить("Размер", РазмерДанных);
	ВозвращаемоеЗначение.Вставить("АдресВременногоФайла", ИмяВременногоФайла);
	ВозвращаемоеЗначение.Вставить("Ошибка", Ошибка);
	
	Возврат ВозвращаемоеЗначение;
#КонецЕсли

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыбратьФайлИзФайловогоХранилища(ОписаниеОповещения)
	
	ЗаголовокДиалога = НСтр("ru = 'Выберите файл'");
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = ЗаголовокДиалога;
	ДиалогВыбораФайла.ПолноеИмяФайла = "";
	ДиалогВыбораФайла.МножественныйВыбор = Истина;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.ПредварительныйПросмотр = Истина;
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецФункции


#КонецОбласти

