////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с задачами (сервер).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет, активна ли задача исполнителя, т.е. доступна ли для исполнения исполнителем.
//
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.ЗадачаИсполнителя - Проверяемая задача.
// 
// Возвращаемое значение:
//  Булево - Задача активна.
//
Функция ЗадачаАктивна(ЗадачаСсылка) Экспорт
	
	РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаСсылка,
		"ПометкаУдаления, ИсключенаИзПроцесса, Выполнена, СостояниеБизнесПроцесса");
	СостояниеВыполненияЗадачи = РегистрыСведений.ЗадачиДляВыполнения.СостояниеВыполненияЗадачи(ЗадачаСсылка);
	
	ЗадачаАктивна =
		РеквизитыЗадачи.ПометкаУдаления = Ложь
		И РеквизитыЗадачи.ИсключенаИзПроцесса = Ложь
		И РеквизитыЗадачи.Выполнена = Ложь
		И РеквизитыЗадачи.СостояниеБизнесПроцесса <> Перечисления.СостоянияБизнесПроцессов.Прерван
		И СостояниеВыполненияЗадачи.СостояниеВыполнения <> Перечисления.СостоянияЗадачДляВыполнения.ГотоваКВыполнению;
	
	Возврат ЗадачаАктивна;
	
КонецФункции

#КонецОбласти