////////////////////////////////////////////////////////////////////////////////
// Учет самочувствия сотрудников (сервер, повторное использование на время сеанса).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет ответственных за учет самочувствия сотрудников.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.Пользователи - Ответственные за учет самочувствия сотрудников.
//
Функция ОтветственныеЗаУчетСамочувствияСотрудников() Экспорт
	
	Возврат УчетСамочувствияСотрудниковСервер.ОтветственныеЗаУчетСамочувствияСотрудников();
	
КонецФункции

#КонецОбласти