
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрПоказывать = Новый ПараметрКомпоновкиДанных("Показывать"); 
	Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.Элементы Цикл
		Если (ТипЗнч(ЭлементНастроек) = Тип("ДоступныйПараметрКомпоновкиДанных"))
			И (ЭлементНастроек.Параметр = ПараметрПоказывать) Тогда  
			ЭлементНастроек.ДоступныеЗначения.Очистить();
			Индекс = 0;
			РаздельныйУчет = ПолучитьФункциональнуюОпцию("РаздельныйУчетДокументов");
			Если РаздельныйУчет Тогда 
				ЭлементНастроек.ДоступныеЗначения.Вставить(Индекс, "БезОригиналов", 
					НСтр("ru = 'Не получен оригинал или не приложена скан-копия'"));
				Индекс = Индекс + 1;
				ЭлементНастроек.ДоступныеЗначения.Вставить(Индекс, "ТолькоБезОригиналов", 
					НСтр("ru = 'Только без оригиналов'"));
				Индекс = Индекс + 1;
				ЭлементНастроек.ДоступныеЗначения.Вставить(Индекс, "ТолькоБезСканКопий", 
					НСтр("ru = 'Только без скан-копий'"));
				Индекс = Индекс + 1;
			Иначе 
				ЭлементНастроек.ДоступныеЗначения.Вставить(Индекс, "БезОригиналов", 
					НСтр("ru = 'Только без скан-копий'"));
				Индекс = Индекс + 1;
			КонецЕсли;
			
			ЭлементНастроек.ДоступныеЗначения.Вставить(Индекс, "Все", НСтр("ru = 'Все'"));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
