////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, вызываемые с клиента, для работы механизма
// выполнения задач по почте
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует уведомление и помещает его в очередь на отправку по задаче.
// Возвращает Истину, если доступно формирование уведомления и уведомление сформировано.
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаИсполнителя - ссылка на задачу.
//
// Возвращаемое значение:
//  Булево
//
Функция СформироватьУведомлениеПоЗадаче(Задача) Экспорт
	
	Возврат ВыполнениеЗадачПоПочтеСервер.СформироватьУведомлениеПоЗадаче(Задача);
	
КонецФункции

#КонецОбласти