
// Только для внутреннего использования
Функция ТаблицаПустогоНабораЗаписей(ПолноеИмяРегистра) Экспорт
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяРегистра);
	
	Возврат Менеджер.СоздатьНаборЗаписей().Выгрузить();
	
КонецФункции

Функция СвойстваВидовДоступа() Экспорт
	
	Возврат ПланыВидовХарактеристик.ВидыДоступа.СвойстваВидовДоступа();
	
КонецФункции

Функция ВозможныеПраваДляНастройкиПравОбъектов() Экспорт
	
	Возврат УправлениеДоступомДокументооборот.ВозможныеПрава();
	
КонецФункции
