
#Область ПрограмныйИнтерфейс

Процедура ДобавитьЗаписьОбОшибке(ПредметОшибки, Описание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПредметОшибки                       = ПредметОшибки;
	МенеджерЗаписи.ОписаниеПроблемы                    = Описание;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписьОбОшибке(ПредметОшибки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПредметОшибки = ПредметОшибки;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтправленностьУведомления(ПредметОшибки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПредметОшибки = ПредметОшибки;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.УведомлениеОтправлено = Истина;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
