
#Область ПрограммныйИнтерфейс

// 
//
// Параметры:
//  ЭлементТаблицаФормы - ТаблицаФормы - Элемент формы, видимость которого учитывается.
//  ДанныеТаблицаФормы - ДанныеФормыДерево, ДинамическийСписок - Данные таблицы, для подсчета количества строк.
//  ДекорацияФормы - ДекорацияФормы - Декорация, заголовок которой нужно оформить.
//
Процедура ОбновитьСтраницыИПереключатели(Форма) Экспорт
	
	ПараметрыКлиента = Форма.ПараметрыМобильныйКлиент;
	Страницы = Форма.Элементы[ПараметрыКлиента.ЭлементСтраницыИмя];
	
	ВидимыеСтраницы = Новый Массив();//Массив из ГруппаФормы - 
	Для Каждого Страница Из Страницы.ПодчиненныеЭлементы Цикл
		
		//Скроем страницы, где нет видимых элементов.
		Страница.Видимость = Ложь;
		Для Каждого Элемент Из Страница.ПодчиненныеЭлементы Цикл
			Если Элемент.Видимость Тогда
				Страница.Видимость = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Страница.Видимость Тогда
			ВидимыеСтраницы.Добавить(Страница);
		КонецЕсли;
	КонецЦикла;
	
	ТекущийИндекс = ВидимыеСтраницы.Найти(Страницы.ТекущаяСтраница);
	Если ТекущийИндекс = Неопределено Тогда
		ТекущийИндекс = 0;
		Страницы.ТекущаяСтраница = ВидимыеСтраницы[0];
	КонецЕсли;
	
	СтраницуВлево = Форма.Элементы["ПереключитьСтраницуВлевоМК"];
	Если ТекущийИндекс = 0 Тогда
		Если ВидимыеСтраницы.Количество() > 2 Тогда
			СтраницуВлево.Доступность = Истина;
			СтраницуВлево.Заголовок   = ВидимыеСтраницы.Получить(ВидимыеСтраницы.Количество() - 1).Заголовок;
		Иначе
			СтраницуВлево.Доступность = Ложь;
			СтраницуВлево.Заголовок   = " ";
		КонецЕсли;
	Иначе
		СтраницуВлево.Доступность = Истина;
		СтраницуВлево.Заголовок   = ВидимыеСтраницы.Получить(ТекущийИндекс - 1).Заголовок;
	КонецЕсли;
	
	ПраваяВкладка = Форма.Элементы["ПереключитьСтраницуВправоМК"];
	Если ТекущийИндекс = ВидимыеСтраницы.Количество() - 1 Тогда
		Если ВидимыеСтраницы.Количество() > 2 Тогда
			ПраваяВкладка.Доступность = Истина;
			ПраваяВкладка.Заголовок   = ВидимыеСтраницы.Получить(0).Заголовок;
		Иначе
			ПраваяВкладка.Доступность = Ложь;
			ПраваяВкладка.Заголовок   = " ";
		КонецЕсли;
	Иначе
		ПраваяВкладка.Доступность = Истина;
		ПраваяВкладка.Заголовок   = ВидимыеСтраницы.Получить(ТекущийИндекс + 1).Заголовок;
	КонецЕсли;
	
	ТекущаяВкладка = Форма.Элементы["ТекущаяСтраницаМК"];
	ТекущаяВкладка.Заголовок = Страницы.ТекущаяСтраница.Заголовок;
	
КонецПроцедуры

//
//
Процедура ОбновитьОформлениеВкладок(Форма, Страницы, Переключатели) Экспорт
	
	//ПараметрыКлиента = Форма.ПараметрыМобильныйКлиент;
	//Страницы = Форма.Элементы[ПараметрыКлиента.ЭлементВкладкиИмя];
	
	// Получим индекс текущей страницы.
	// По индексу установим оформление картинки и подписи переключателей вкладок.
	
	ПараметрыМобильныйКлиент = Форма.ПараметрыМобильныйКлиент;
	КоличетсвоВкладок = Страницы.ПодчиненныеЭлементы.Количество() - 1;
	Элементы = Форма.Элементы;
	Для Индекс = 0 По КоличетсвоВкладок Цикл
		
		ИндексСтрокой = Формат(Индекс, "ЧН=0; ЧГ=");
		Если Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[Индекс] Тогда
			
			//Элементы["ВкладкаМККартинка" + ИндексСтрокой].ЦветТекста = ПараметрыМобильныйКлиент.ЦветТекущейВкладки;
			Элементы["ВкладкаМКПодпись" + ИндексСтрокой].ЦветТекста = ПараметрыМобильныйКлиент.ЦветТекущейВкладки;
			Элементы["ВкладкаМКПодпись" + ИндексСтрокой].Шрифт = ПараметрыМобильныйКлиент.ШрифтТекущейВкладки;
			
		Иначе
			
			//Элементы["ВкладкаМККартинка" + ИндексСтрокой].ЦветТекста = ПараметрыМобильныйКлиент.ЦветВкладки;
			Элементы["ВкладкаМКПодпись" + ИндексСтрокой].ЦветТекста = ПараметрыМобильныйКлиент.ЦветВкладки;
			Элементы["ВкладкаМКПодпись" + ИндексСтрокой].Шрифт = ПараметрыМобильныйКлиент.ШрифтВкладки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
