
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет данные в регистре для данного шаблона
//
// Параметры:
//  ШаблонПроцесса - ссылка на шаблон.
//
Процедура ОбновитьСведенияПоШаблону(ШаблонПроцесса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК Количество
		|ИЗ
		|	РегистрСведений.НастройкаШаблоновБизнесПроцессов КАК НастройкаШаблоновБизнесПроцессов
		|ГДЕ
		|	НастройкаШаблоновБизнесПроцессов.ШаблонБизнесПроцесса = &ШаблонБизнесПроцесса
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкаШаблоновБизнесПроцессов.ШаблонБизнесПроцесса";
		
	Запрос.УстановитьПараметр("ШаблонБизнесПроцесса", ШаблонПроцесса);	
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	
	МенеджерЗаписи = РегистрыСведений.КоличествоНастроекШаблоновПроцессов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ШаблонПроцесса = ШаблонПроцесса;
	МенеджерЗаписи.КоличествоНастроек = Выборка.Количество;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает количество настроек по шаблону.
//
// Параметры:
//  Шаблон - ссылка на шаблон
//
// Возвращаемое значение:
//  Числов
//
Функция КоличествоНастроекПоШаблону(Шаблон) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоНастроекШаблоновПроцессов.КоличествоНастроек КАК КоличествоНастроек
		|ИЗ
		|	РегистрСведений.КоличествоНастроекШаблоновПроцессов КАК КоличествоНастроекШаблоновПроцессов
		|ГДЕ
		|	КоличествоНастроекШаблоновПроцессов.ШаблонПроцесса = &ШаблонПроцесса";
	Запрос.УстановитьПараметр("ШаблонПроцесса", Шаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоНастроек;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли

