////////////////////////////////////////////////////////////////////////////////
// Подсистема "Напоминания пользователя" (клиент) - переопределение в конфигурации Документооборот.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Показывает текущие напоминания, согласно настроенному варианту показа.
//
Процедура ПоказатьТекущиеНапоминания() Экспорт
	
	ТекущиеНапоминания = НапоминанияПользователяКлиент.ПолучитьТекущиеОповещения();
	Если ТекущиеНапоминания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытаФормаВсехНапоминаний = ОткрытаФормаВсехНапоминаний();
	Оповестить("ЗакрытьФормуНапоминания");
	
	ТекущиеНапоминания = НапоминанияПользователяКлиент.ПолучитьТекущиеОповещения();
	КоличествоНапоминаний = ТекущиеНапоминания.Количество();
	Если КоличествоНапоминаний > 1 Или ОткрытаФормаВсехНапоминаний Тогда
		
		ПоказатьВсеТекущиеНапоминания();
		
	ИначеЕсли КоличествоНапоминаний = 1 Тогда
		
		Для Каждого ТекущееНапоминание Из ТекущиеНапоминания Цикл
			ПоказатьНапоминание(ТекущееНапоминание);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Прекращает напоминания.
//
// Параметры:
//  ПрекращаемыеНапоминания - Массив - Напоминания, которые необходимо прекратить.
//                                     См. НапоминанияПользователяКлиентСервер.ОписаниеНапоминания().
//
Процедура ПрекратитьНапоминания(ПрекращаемыеНапоминания) Экспорт
	
	Если ПрекращаемыеНапоминания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыПрекращенияНапоминаний =
		НапоминанияПользователяДокументооборотВызовСервера.ПрекратитьНапоминания(ПрекращаемыеНапоминания);
	
	Для Каждого ПрекращаемоеНапоминание Из ПрекращаемыеНапоминания Цикл
		НапоминанияПользователяКлиент.УдалитьЗаписьИзКэшаОповещений(ПрекращаемоеНапоминание);
	КонецЦикла;
	
	Для Каждого РезультатПрекращенияНапоминания Из РезультатыПрекращенияНапоминаний Цикл
		
		Если РезультатПрекращенияНапоминания.ПодключеноНовоеНапоминание Тогда
			НапоминанияПользователяКлиент.ОбновитьЗаписьВКэшеОповещений(РезультатПрекращенияНапоминания.НовоеНапоминание);
		Иначе
			Оповестить("Удаление_НапоминанияПользователя_Документооборот",, РезультатПрекращенияНапоминания.ИсточникНапоминания);
		КонецЕсли;
		
	КонецЦикла;
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НапоминанияПользователя"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, открыта ли форма показа всех напоминаний.
//
// Возвращаемое значение:
//  Булево - Открыта форма показа всех напоминаний.
//
Функция ОткрытаФормаВсехНапоминаний()
	
	ОткрытаФормаВсехНапоминаний = ОбщегоНазначенияДокументооборотКлиент.ОткрытаФорма(ИмяФормыТекущиеНапоминания());
	
	Возврат ОткрытаФормаВсехНапоминаний;
	
КонецФункции

// Открывает форму показа всех текущих напоминаний.
//
Процедура ПоказатьВсеТекущиеНапоминания()
	
	ФормаТекущиеНапоминания = ПолучитьФорму(ИмяФормыТекущиеНапоминания());
	Если ФормаТекущиеНапоминания.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	ФормаТекущиеНапоминания.Открыть();
	
КонецПроцедуры

// Открывает форму показа одного напоминания.
//
// Параметры:
//  Напоминание - Структура - Напоминание.
//   * ВремяСобытия                      - Дата                                                  - Дата предмета, по которой расчитан срок.
//   * ИмяРеквизитаИсточника -           - Строка                                                - Реквизит предмета, для расчета срока.
//   * ИндексКартинки                    - Число                                                 - Индекс картинки напоминания.
//   * ИнтервалВремениНапоминания        - Число                                                 - Установленно согласно способу установки время.
//   * Источник                          - СправочникСсылка.ЗаписиРабочегоКалендаря              - Предмет напоминания.
//   * Описание                          - Строка                                                - Текст напоминания.
//   * Пользователь                      - СправочникСсылка.Пользователи                         - Кто должен получить напоминание.
//   * СпособУстановкиВремениНапоминания - ПеречислениеСсылка.СпособыУстановкиВремениНапоминания - Способ установки времени напоминания.
//   * СрокНапоминания                   - Дата                                                  - Когда должно сработать напоминание.
//
Процедура ПоказатьНапоминание(Напоминание)
	
	ПараметрыФормы = Новый Структура("Напоминание", Напоминание);
	ФормаОповещения = ПолучитьФорму(
		ИмяФормыОдногоНапоминания(),
		ПараметрыФормы,,
		Напоминание.Источник.УникальныйИдентификатор());
	Если ФормаОповещения.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	ФормаОповещения.Открыть();
	
КонецПроцедуры

// Возвращает имя формы показа одного текущего напоминания.
//
// Возвращаемое значение:
//  Строка - Возвращает имя формы показа одного напоминания.
//
Функция ИмяФормыОдногоНапоминания()
	
	ИмяФормыОдногоНапоминания = "РегистрСведений.НапоминанияПользователя.Форма.ФормаОповещенияДокументооборот";
	
	Возврат ИмяФормыОдногоНапоминания;
	
КонецФункции

// Возвращает имя формы показа всех текущих напоминаний.
//
// Возвращаемое значение:
//  Строка - Возвращает имя формы показа всех текущих напоминания.
//
Функция ИмяФормыТекущиеНапоминания()
	
	ИмяФормыТекущиеНапоминания = "РегистрСведений.НапоминанияПользователя.Форма.ФормаОповещения";
	
	Возврат ИмяФормыТекущиеНапоминания;
	
КонецФункции

#КонецОбласти