////////////////////////////////////////////////////////////////////////////////
// Помощник отправить (клиент/сервер) для КОРП: 
//  Содержит особые интерфейсные функции и процедуры для рекции КОРП,
//  по работе с помощником отправки.
//  
///////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс_РежимыРаботы

// Возвращает режим работы ОтправкаПроектовИлиПроектныхЗадач.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимРаботыОтправкаПроектовИлиПроектныхЗадач() Экспорт
	
	Возврат "ОтправкаПроектовИлиПроектныхЗадач";
	
КонецФункции

// Возвращает режим работы ВыборВариантаОтправкиДляДействияКомплексногоПроцесса.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимРаботыВыборВариантаОтправкиДляДействияКомплексногоПроцесса() Экспорт
	
	Возврат "ВыборВариантаОтправкиДляДействияКомплексногоПроцесса";
	
КонецФункции

#КонецОбласти