
////////////////////////////////////////////////////////////////////////////////
// <Шаблоны бизнес процессов клиент сервер>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, является ли ссылка на объект шаблоном процесса.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на любой объект.
//
// Возвращаемое значение:
//  Булево - возвращает истину, если объект является шаблоном процесса.
//
Функция ЭтоШаблонПроцесса(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	
	ТипыШаблоновПроцессов = Новый Массив;
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныИсполнения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныОзнакомления"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныПоручения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныПриглашения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныРассмотрения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныРегистрации"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныСогласования"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныСоставныхБизнесПроцессов"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныУтверждения"));
	
	Возврат ТипыШаблоновПроцессов.Найти(ТипОбъекта) <> Неопределено;
	
КонецФункции

// Возвращает имена справочников шаблонов.
//
// Возвращаемое значение:
//  Массив
//
Функция ИменаСправочниковШаблонов() Экспорт
	
	ИменаСправочников = Новый Массив;
	ИменаСправочников.Добавить("ШаблоныИсполнения");
	ИменаСправочников.Добавить("ШаблоныКомплексныхБизнесПроцессов");
	ИменаСправочников.Добавить("ШаблоныОзнакомления");
	ИменаСправочников.Добавить("ШаблоныПриглашения");
	ИменаСправочников.Добавить("ШаблоныПоручения");
	ИменаСправочников.Добавить("ШаблоныРассмотрения");
	ИменаСправочников.Добавить("ШаблоныРегистрации");
	ИменаСправочников.Добавить("ШаблоныСогласования");
	ИменаСправочников.Добавить("ШаблоныСоставныхБизнесПроцессов");
	ИменаСправочников.Добавить("ШаблоныУтверждения");
	
	Возврат ИменаСправочников;
	
КонецФункции

// Возвращает шаблоны процессов по умолчанию.
//
// Возвращаемое значение:
//  Массив
//
Функция ШаблоныПроцессовПоУмолчанию() Экспорт
	
	ШаблоныПоУмолчанию = Новый Массив;
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныИсполнения.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныКомплексныхБизнесПроцессов.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныОзнакомления.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныПриглашения.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныРассмотрения.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныРегистрации.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСогласования.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСоставныхБизнесПроцессов.ОбработкаВнутреннегоДокументаПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСоставныхБизнесПроцессов.ОбработкаВходящегоДокументаПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСоставныхБизнесПроцессов.ОбработкаИсходящегоДокументаПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныУтверждения.ПоУмолчанию"));
	
	Возврат ШаблоныПоУмолчанию;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс_ДоступностьШаблоновПроцессов

// Обновляет видимость группы доступности в карточке шаблона.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - карточка шаблона процесса.
//
Процедура ОбновитьОтображениеГруппыДоступности(Форма) Экспорт
	
	Форма.Элементы.ГруппаДоступностьШаблона.Видимость = 
		ЗначениеЗаполнено(Форма.Объект.Ссылка) И Не Форма.ЭтоДействиеКомплексногоПроцесса;
	
КонецПроцедуры

// Обновляет отображение признака доступности шаблона процесса в карточке.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - карточка шаблона процесса.
//
Процедура ОбновитьОтображениеДоступностиШаблона(Форма) Экспорт
	
	Если Не Форма.ДоступенРучнойЗапускПоШаблону И Не Форма.ДоступенАвтоматическийЗапускПоШаблону Тогда
		Форма.Элементы.ГруппаДоступностьШаблонаСтраницы.ТекущаяСтраница = 
			Форма.Элементы.ГруппаШаблонНедоступенЗапуска;
	ИначеЕсли Форма.ДоступенРучнойЗапускПоШаблону И Не Форма.ДоступенАвтоматическийЗапускПоШаблону Тогда
		Форма.Элементы.ГруппаДоступностьШаблонаСтраницы.ТекущаяСтраница = 
			Форма.Элементы.ГруппаРучнойЗапуск;
	Иначе
		Форма.Элементы.ГруппаДоступностьШаблонаСтраницы.ТекущаяСтраница = 
			Форма.Элементы.ГруппаРучнойИАвтоматическийЗапуск;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти