
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДекорацияОписание.Заголовок = 
		СтрШаблон(НСтр("ru = 'Выполнено задач: %1.'"), Параметры.ЗадачиМожноВыполнить.Количество())
		 + " " + СтрШаблон(НСтр("ru = 'Не выполнено задач: %1.'"), Параметры.ЗадачиНельзяВыполнить.Количество());
		
	ЗадачиСОшибками.Очистить();
	
	Для Каждого Стр Из Параметры.ЗадачиНельзяВыполнить Цикл
		
		НовСтр = ЗадачиСОшибками.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиСОшибкамиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрДанные = ЗадачиСОшибками.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Данные = СтрДанные.Задача;
	ПоказатьЗначение(, Данные);
	
КонецПроцедуры
