////////////////////////////////////////////////////////////////////////////////
// Общего назначения Документооборот (клиент).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Показывает вопрос "Да" / "Нет", принимая Esc и закрытие формы крестиком как ответ "Нет".
//
// Параметры:
//   ОписаниеОповещенияОЗавершении - ОписаниеОповещения - процедура, вызываемая после закрытия с
//     передачей параметра КодВозвратаДиалога.Да или КодВозвратаДиалога.Нет.
//   ТекстВопроса - Строка - текст задаваемого вопроса.
//   ТекстКнопкиДа - Строка - необязательный, текст кнопки "Да".
//   ТекстКнопкиНет - Строка - необязательный, текст кнопки "Нет".
//   КнопкаПоУмолчанию - РежимДиалогаВопрос - необязательный, кнопка по умолчанию.
//
Процедура ПоказатьВопросДаНет(ОписаниеОповещенияОЗавершении, ТекстВопроса,
	ТекстКнопкиДа = Неопределено, ТекстКнопкиНет = Неопределено, КнопкаПоУмолчанию = Неопределено) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПоказатьВопросДаНетЗавершение", ЭтотОбъект, ОписаниеОповещенияОЗавершении);
		
	Кнопки = Новый СписокЗначений;
	Если ТекстКнопкиДа = Неопределено Тогда
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Да'"));
	Иначе
		Кнопки.Добавить(КодВозвратаДиалога.ОК, ТекстКнопкиДа);
	КонецЕсли;
	Если ТекстКнопкиНет = Неопределено Тогда
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Нет'"));
	Иначе
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, ТекстКнопкиНет);
	КонецЕсли;
	
	Если КнопкаПоУмолчанию = Неопределено Тогда
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
	ИначеЕсли КнопкаПоУмолчанию = КодВозвратаДиалога.Да Тогда
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки,, КодВозвратаДиалога.ОК);
	ИначеЕсли КнопкаПоУмолчанию = КодВозвратаДиалога.Нет Тогда
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки,, КодВозвратаДиалога.Отмена);
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение кнопки по умолчанию: %1'"),
			КнопкаПоУмолчанию);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после закрытия окна с вопросом "Да" / "Нет" и вызывает ранее переданный обработчик
// оповещения с передачей ответа пользователя.
//
// Параметры:
//   Результат - КодВозвратаДиалога - ответ пользователя,
//     КодВозвратаДиалога.ОК или КодВозвратаДиалога.Отмена.
//   ОписаниеОповещения - ОписаниеОповещения - описание вызываемого оповещения.
//
Процедура ПоказатьВопросДаНетЗавершение(Результат, ОписаниеОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

// Удаляет строки переданной таблицы формы, в которых проверяемый реквизит не заполнен.
//
// Параметры:
//  ТаблицаФормы 			- Таблица формы - в которой осуществляется удаление не заполненых строк.
//  ИмяРеквизитаПроверки    - Строка - имя реквизита, заполненность которого проверяется.
//
Процедура УдалитьПустыеСтрокиТаблицы(ТаблицаФормы, ИмяРеквизитаПроверки) Экспорт
	
	КоличествоСтрок = ТаблицаФормы.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Строка = ТаблицаФормы[КоличествоСтрок - Инд];
		
		Если Не ЗначениеЗаполнено(Строка[ИмяРеквизитаПроверки]) Тогда 
			ТаблицаФормы.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВставитьВОписаниеОповещенияОЗакрытииСсылкуНаОбъект(Форма) Экспорт
	
	Если Форма.ОписаниеОповещенияОЗакрытии <> Неопределено
		И ТипЗнч(Форма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры) = Тип("Структура") Тогда
		Форма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("СсылкаНаОбъект", Форма.Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// В случае, если объект не записан в базу, записывает его, предварительно задвая вопрос
// и выполняет дополнительное действие
// 
// Параметры:
//  Форма - Форма - форма объекта
//  ИмяОсновногоРеквизита - Строка - имя реквизита, указывающего на объект
//  ТекстВопроса - Строка - текст вопроса, который надо задать перед записью
//  Действие - ОписаниеОповещения - описание дополнительного действия
// 
Процедура ЗаписатьОбъектЕслиНовыйИВыполнитьДействие(
		ФормаОбъекта, ИмяОсновногоРеквизита, ТекстВопроса, Действие) Экспорт
	
	СсылкаНаОбъект = ФормаОбъекта[ИмяОсновногоРеквизита].Ссылка;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаписатьОбъектЕслиНовыйИВыполнитьДействиеЗавершение",
		ЭтотОбъект,
		Новый Структура("ФормаОбъекта, СсылкаНаОбъект, Действие", ФормаОбъекта, СсылкаНаОбъект, Действие));
	
	// Предварительная запись нового объекта
	Если СсылкаНаОбъект.Пустая() Тогда
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Служебная процедура
Процедура ЗаписатьОбъектЕслиНовыйИВыполнитьДействиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.ОК Тогда
		
		Если Не Параметры.ФормаОбъекта.Записать() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.Действие);
	
КонецПроцедуры

// Обработка события формы ПередЗакрытием.
//
// Параметры:
//  Отказ - Булево - Признак отказа от закрытия формы.
//  ЗавершениеРаботы - Булево - Признак того, что форма закрывается в процессе завершения работы приложения.
//  ТекстПредупреждения - Строка - Текст предупреждения.
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной обработки события.
//  Модифицированость - Булево - Признак изменения данных в форме.
// 
// Возвращаемое значение:
//  Булево - Признак необходимости отключения дальнейшей обработки события.
//
Функция ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированость) Экспорт
	
	Если Не ЗавершениеРаботы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Модифицированость Тогда
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Данные были изменены. Все изменения будут потеряны.'");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработка события формы ПриЗакрытии.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак того, что форма закрывается в процессе завершения работы приложения.
// 
// Возвращаемое значение:
//  Булево - Признак необходимости отключения дальнейшей обработки события.
//
Функция ПриЗакрытии(ЗавершениеРаботы) Экспорт
	
	Если Не ЗавершениеРаботы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет, существует ли открытый экземпляр формы.
//
// Параметры:
//  ИмяФормы - Строка - Имя формы.
// 
// Возвращаемое значение:
//  Булево - Текстовое описание содержания возвращаемого значения функции.
//
// Пример:
//  ОткрытаФормаНапоминания = ОбщегоНазначенияДокументооборотКлиент.ОткрытаФорма(
//  	"РегистрСведений.НапоминанияПользователя.Форма.ТекущееНапоминание");
//
Функция ОткрытаФорма(ИмяФормы) Экспорт
	
	ОткрытаФорма = Ложь;
	Для Каждого ОкноКлиентскогоПриложения Из ПолучитьОкна() Цикл
		
		Для Каждого ФормаКлиентскогоПриложения Из ОкноКлиентскогоПриложения.Содержимое Цикл
			
			Если ТипЗнч(ФормаКлиентскогоПриложения) = Тип("ФормаКлиентскогоПриложения") 
				И ФормаКлиентскогоПриложения.ИмяФормы = ИмяФормы
				И ФормаКлиентскогоПриложения.Открыта() Тогда
				ОткрытаФорма = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОткрытаФорма Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОткрытаФорма;
	
КонецФункции

// Устанавливает пометки удаления.
//
// Параметры:
//  ОбъектыКУдалению - Массив из ЛюбаяСсылка - Объекты к удалению. Все объекты должны быть одного типа.
//
Процедура УстановитьПометкуУдаления(ОбъектыКУдалению) Экспорт
	
	Если ОбъектыКУдалению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектов = ТипЗнч(ОбъектыКУдалению[0]);
	Для Каждого ОбъектКУдалению Из ОбъектыКУдалению Цикл
		
		Если ТипЗнч(ОбъектКУдалению) <> ТипОбъектов Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Некорректный тип элемента %1. Все объекты должны быть одного типа %2.'"),
				ТипЗнч(ОбъектКУдалению),
				ТипОбъектов);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыПометки =
		ОбщегоНазначенияДокументооборотВызовСервера.ПараметрыУстановкиПометкиУдаления(ОбъектыКУдалению);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ОбъектыКУдалению", ОбъектыКУдалению);
	ПараметрыОбработчика.Вставить("ПометкаУдаления", ПараметрыПометки.ПометкаУдаления);
	ПараметрыОбработчика.Вставить("ИмяСобытия", ПараметрыПометки.ИмяСобытия);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УстановитьПометкуУдаленияПослеВопроса",
		ЭтотОбъект,
		ПараметрыОбработчика);
	
	ПоказатьВопросДаНет(
		ОписаниеОповещения,
		ПараметрыПометки.ТекстВопроса,
		Неопределено,
		Неопределено,
		КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик оповещения процедуры УстановитьПометкуУдаления.
//
// Параметры:
//  Результат - КодВозвратаДиалога - Результат вопроса.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//   * ОбъектыКУдалению - Массив из ЛюбаяСсылка - Объекты к удалению.
//   * ПометкаУдаления - Булево - Пометка удаления, которую необходимо установить.
//   * ИмяСобытия - Строка - Имя события оповещения.
//
Процедура УстановитьПометкуУдаленияПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияДокументооборотВызовСервера.УстановитьПометкуУдаления(
		ДополнительныеПараметры.ОбъектыКУдалению,
		ДополнительныеПараметры.ПометкаУдаления);
	
	ТекстОповещения = "";
	НавигационнаяСсылка = Неопределено;
	Пояснение = "";
	КоличествоОбъектов = ДополнительныеПараметры.ОбъектыКУдалению.Количество();
	Если КоличествоОбъектов = 1 И ДополнительныеПараметры.ПометкаУдаления = Истина Тогда
		
		ТекстОповещения = НСтр("ru = 'Пометка удаления установлена'");
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ДополнительныеПараметры.ОбъектыКУдалению[0]);
		Пояснение = Строка(ДополнительныеПараметры.ОбъектыКУдалению[0]);
		
	ИначеЕсли КоличествоОбъектов = 1 И ДополнительныеПараметры.ПометкаУдаления = Ложь Тогда
		
		ТекстОповещения = НСтр("ru = 'Пометка удаления снята'");
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ДополнительныеПараметры.ОбъектыКУдалению[0]);
		Пояснение = Строка(ДополнительныеПараметры.ОбъектыКУдалению[0]);
		
	ИначеЕсли КоличествоОбъектов > 1 И ДополнительныеПараметры.ПометкаУдаления = Истина Тогда
		
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Пометка удаления установлена (%1)'"), КоличествоОбъектов);
		Пояснение = Строка(ТипЗнч(ДополнительныеПараметры.ОбъектыКУдалению[0]));
		
	ИначеЕсли КоличествоОбъектов > 1 И ДополнительныеПараметры.ПометкаУдаления = Ложь Тогда
		
		ТекстОповещения = СтрШаблон(НСтр("ru = 'Пометка удаления снята (%1)'"), КоличествоОбъектов);
		Пояснение = Строка(ТипЗнч(ДополнительныеПараметры.ОбъектыКУдалению[0]));
		
	КонецЕсли;
	ПоказатьОповещениеПользователя(
		ТекстОповещения,
		НавигационнаяСсылка,
		Пояснение,
		БиблиотекаКартинок.ДиалогИнформация);
	
	Если ДополнительныеПараметры.ОбъектыКУдалению.Количество() = 1 Тогда
		Оповестить(ДополнительныеПараметры.ИмяСобытия, Неопределено, ДополнительныеПараметры.ОбъектыКУдалению[0]);
		ОповеститьОбИзменении(ДополнительныеПараметры.ОбъектыКУдалению[0]);
	Иначе
		Оповестить(ДополнительныеПараметры.ИмяСобытия, Неопределено);
		ОповеститьОбИзменении(ТипЗнч(ДополнительныеПараметры.ОбъектыКУдалению[0]));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
