///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьДанныеРасшифровкиОтчета(
		АдресДанных,
		Идентификатор,
		СтандартнаяОбработка) Экспорт
	
	ДанныеРасшифровки   = ПолучитьИзВременногоХранилища(АдресДанных);
	
	ЗначениеРасшифровки = ДанныеРасшифровки.Элементы[Идентификатор];
	ПоляРасшифровки     = ЗначениеРасшифровки.ПолучитьПоля();
	
	Для Каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		Если ПолеРасшифровки.Поле = "ПараметрыДанных.НадписьНаПортале" Тогда
			СтандартнаяОбработка = Ложь;
			Возврат ПолеРасшифровки.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область НастройкиОтчетаПоУмолчанию

//Выполняет заполнение категорий и разделов в зависимости от варианта отчета
//Параметры:КлючВариантаОтчета - Строковое название варианта отчета
//			СписокКатегорий - в список добавляются необходимые категории
//			СписокРазделов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
		
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.ДокументыИФайлы));
	
	Если КлючВариантаОтчета = "Основной" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.КонтрагентыСписок);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоКонтрагентам);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли