#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Обработки.ИнтерфейсСервиса.ПроверитьВерсиюИнтерфейса(5, Отказ);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Активировать(Команда)

	Если АктивироватьНаСервере() Тогда
		ПоказатьПредупреждение( , СтрШаблон(НСтр("ru = 'Промокод ''%1'' активирован.'"), Промокод));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АктивироватьНаСервере()

	КодОтвета = 0;
	ОписаниеОшибки = "";
	Результат = ПрограммныйИнтерфейсСервиса.ИспользоватьПромокод(Промокод, Ложь,, КодОтвета, ОписаниеОшибки);
	Если Не Результат Тогда
		Если КодОтвета = 10404 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Указан неверный промокод.'"), , ,"Промокод");
		Иначе
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2", КодОтвета, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции

#КонецОбласти